{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 700], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 60], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "dtype": "float32", "output_dim": 100, "trainable": false, "embeddings_regularizer": null, "input_dim": 92250, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 700], "activity_regularizer": null, "input_length": 700}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_2", "dtype": "float32", "output_dim": 100, "trainable": false, "embeddings_regularizer": null, "input_dim": 92250, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 60], "activity_regularizer": null, "input_length": 60}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_2"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_1"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "bidirectional_1"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_2"}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "name": "bidirectional_2"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["bidirectional_2", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1000, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 700, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["activation_1", 0, 0, {}]]], "name": "concatenate_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 700, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "dense_3"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "activation_2"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["activation_1", 0, 0], ["activation_2", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}